NAMING

1)  pre-events пред-события
        - для имен используется настоящее время глагола 
        - вызываются прежде чем будет иметь место побочный эффект
        - Пример: Closing событие перед закрытием окна,

2)  post-events пост-события
        - для имен используется прошедшее время глагола 
        - вызываются после того как произошел побочный эффект
        - Пример: Closed событие после закрытия окна

-   не следует использовать префиксы/постфиксы before/after


CONVENTIONS

-   для возможности вызова юзерского кода следует использовать параметр-лямбда метода, вместо переопределения этого abstract метода 


