NAMING

-   названия пакетов в иерархии
        - company.product|technology.feature.subnamespace
        - каждое слово с маленькой буквы
        - компания это зарегестрированное в интернете доменное имя обеспечивающее уникальность в мире 
        - название продукта должно быть устойчивым технологическим а не сиюминутное маркетинговое (тк оно в пространстве имен уже останется навсегда)

-   имя пакета должно отличаться от типа/класса

CONVENTIONS

-   в пакете НЕ должно быть меньше 5 типов

-   типы из одного сценария должны находиться вместе в одном пакете
        - чтобы НЕ импортировать большое количество пакетов

-   в главном пакете НЕ должно быть глубокой иерархии, множества уровней тк юзеру их все придется долго учить
    
