NAMING

-   следует понятно называть дополнительный параметр перезагружаемого метода
    так чтобы было видно, какое значение по умолчанию будет при отсутствии данного параметра 
    (в другой версии этого же перезагружаемого метода)
        - например из названий method(name) и method(name,ignoreCase) видно что первый метод игнорирует регистр

-   следует одинаковые параметры в разных перезагружаемых методах называть одинаково
        - также они должны находиться в том же самом порядке от начала




CONVENTIONS


